In [17]:
import pandas as pd
import sqlite3

In [18]:
connection = sqlite3.connect("./Data/sql-murder-mystery.db")

In [19]:
cursor = connection.cursor()

In [20]:
query = '''
SELECT *
FROM crime_scene_report
WHERE type = "murder" and date = 20180115 and city = "SQL City"
'''

In [25]:
list(pd.read_sql(query, con = connection).description)

['Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".']

In [34]:
query = '''    
SELECT *
FROM person
WHERE address_street_name = "Northwestern Dr" 
ORDER BY address_number desc
'''
pd.read_sql(query, con = connection).head(1)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [41]:
query = '''    
SELECT *
FROM person
WHERE address_street_name = "Franklin Ave" and name like "Annabel%"
'''
pd.read_sql(query, con = connection)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [ ]:
query = '''
SELECT g.id, g.person.id, g.name
FROM get_fit_now_member as g
WHERE